---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarBendingDetailType
source: html/e870b7e5-0c67-4a37-326e-951cacb807e1.htm
---
# RebarBendingDetailType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.